Revit 2024 API
SelectableInViewFilter Properties
The SelectableInViewFilter type exposes the following members.
Properties
Name | Description
Inverted
 True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected, and elements that would normally be rejected will be accepted.
 (Inherited from ElementFilter.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from ElementFilter.)
See Also
SelectableInViewFilter Class
Autodesk.Revit.UI.Selection Namespace